# GetDatumSlabComponent

## Description
Gets the datum slab component of an object.

```pascal
FUNCTION GetDatumSlabComponent(object : HANDLE) : INTEGER;
```

```python

def vs.GetDatumSlabComponent(object):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a slab, Slab Style, or the Slab Preferences.|

## Returns
The index of the datum slab component.

## See Also
VS Functions:
SetDatumSlabComponent

## Version
Availability: from Vectorworks 2011
## Category
* Objects - Architectural